cities = [
    "Душанбе", "Хуҷанд", "Айнӣ", "Бохтар", "Бустон", "Ванҷ", "Ваҳдат", "Восеъ", 
    "Ғончӣ", "Гулистон", "Дарвоз", "Деҳмой", "Дӯстӣ", 
    "Ёвон", "Зафаробод", "Исфара", "Истаравшан", "Ишкошим", "Қайроққум",
    "Қалъаихумб", "Қубодиён", "Конибодом", "Кӯлоб", "Кӯшониён", "Леваканд", "Мастчоҳ", "Мурғоб", "Мӯъминобод", "Норак", "Нуробод", "Панҷ", "Панҷакент", "Пархар", "Рашт", "Роғун", "Рӯшон", "Сарбанд", "Спитамен", "Тавилдара", 
    "Темурмалик", "Турсунзода", "Файзобод", "Фархор", "Хамадонӣ", "Ховалинг", "Хоруғ", "Ҳисор", "Ҷаббор Расулов", "Ҷиликӯл", "Шаҳринав", 
    "Шаҳристон", "Шаҳритус", "Шамсиддин Шоҳин", "Шуғнон", "Шӯробод"
]