mizoj="Муштарӣ"

ronanda="Ронанда"

follow_channel="Обуна шудан ба група"

# Ирсоли паёми истиқболӣ ва тугмаҳо ба истифодабаранда
welcome_message = (
        "Ба бот хуш омадед!\n\n"
        "Лутфан шахсияти худро интихоб кунед ва маълумоти заруриро ирсол намоед.\n\n"
        "Ба група обуна шавед, то аз ҳама навигариҳо бохабар бошед."
    )
    
    
reminder_message = (
        "Барои ёфтани мизоҷ, шумо бояд маълумотҳои зеринро ворид кунед:\n"
        "1. Ном\n"
        "2. Аз кадом шаҳр сафарро оғоз мекунед\n"
        "3. Ба кадом шаҳр меравед\n"
        "4. Нарх\n"
        "5. Чанд нафар мизоҷ даркор\n"
        "6. Рақами телефон\n"
        "7. Сурати мошин\n"
    )
