from aiogram import Router, types
from aiogram.filters import CommandStart
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton, CallbackQuery

from words.words import *
# Роутер барои идоракунии фармонҳо
start_router = Router()

# Функсияи /start бо истифодаи CommandStart()
@start_router.message(CommandStart())
async def on_start(message: types.Message):
    user_id = message.from_user.id

    cus_driver_keyboard = InlineKeyboardMarkup(inline_keyboard=[
        [InlineKeyboardButton(text=f"{mizoj} 🧑‍🤝‍🧑", callback_data=f"startclient:{user_id}")],
        [InlineKeyboardButton(text=f"{ronanda} 🚗", callback_data=f"startdriver:{user_id}")],
        [InlineKeyboardButton(text="Обуна шудан ба група 📢", url="https://t.me/ronanda_bot")],
        [InlineKeyboardButton(text="Чи тавр истифода бурдани бот 💡", callback_data="usage_guide")]
    ])

    await message.answer(welcome_message, reply_markup=cus_driver_keyboard)


# Менюи асосӣ барои кӯмак бо қисматҳои гуногуни иттилоот

@start_router.callback_query(lambda c: c.data == "usage_guide")
async def show_help(call: CallbackQuery):
    keyboard = InlineKeyboardMarkup(inline_keyboard=[
        [InlineKeyboardButton(text="Дастур барои фармоиш додани таксӣ 🚖", callback_data="how_order_taxi")],
        [InlineKeyboardButton(text="Дастур барои Ронанда 👨‍🔧", callback_data="how_driver_list")],
        [InlineKeyboardButton(text="Чи тавр пост навистан 📝", callback_data="how_create_post")],
        [InlineKeyboardButton(text="Шарҳи тугмаҳои бот 🔘", callback_data="how_des_menu")],
        [InlineKeyboardButton(text="Меню 🍔", callback_data="inline_menu")]
    ])
    await call.message.answer("Тарзи истифода бурдани бот.", reply_markup=keyboard)

# Ҳар як функсия барои нишон додани иттилооти дахлдор
@start_router.callback_query(lambda c: c.data == "how_order_taxi")
async def order_taxi_info(callback_query: CallbackQuery):
    text = (
        "1. Регистратсия ё ворид шудан 🧑‍💻:\n\n" \
"Агар шумо дар бот аккаунт надошта бошед, тугмаи \"Муштарӣ\" ё \"Маълумотҳои шахсӣ ҳамчун муштарӣ\"-ро аз меню пахш кунед.\n\n" \
"Агар шумо аллакай аккаунт дошта бошед, пас тугмаи \"Фармоиши такси\"-ро пахш кунед.\n\n" \
"2. Интихоби аз кадом шаҳр сафаро оғоз мекунед ва ба кадом шаҳр сафар мекунед 🌍:\n\n" \
"Пас аз пахш кардани \"Фармоиши такси\", бот аз шумо пурсад, ки \"Аз кадом шаҳр сафарро оғоз мекунед?\".\n\n" \
"Шумо шаҳре, ки мехоҳед сафарро оғоз кунед, интихоб кунед. Барои ин, тугмаи шаҳрро пахш кунед.\n\n" \
"Пас аз интихоби шаҳри оғоз, бот шуморо мепурсад, ки \"Ба кадом шаҳр сафар мекунед?\" ва шумо интихоб кунед ки ба кадом шаҳр сафар мекунед.\n\n" \
"3. Намоиши ронандаҳо 🚗:\n\n" \
"Пас аз интихоб кардани шаҳрҳо, бот ронандаҳои онлайнро бо маълумоти онҳо (баҳо, нарх, шумораи ҷойҳо ва рақами телефон) намоиш медиҳад.\n\n" \
"4. Навигатсия байни постҳо 🔄:\n\n" \
"Агар ронандаҳо бештар аз як саҳифа бошанд, шумо метавонед тавассути тугмаҳои \"Пеш\" ва \"Баъд\" саҳифаҳоро иваз кунед, ки барои гузаштан ба саҳифаҳои нав кӯмак мекунад.\n\n" \
"5. Интихоби ниҳоии фармоиш ✅:\n\n" \
"Пас аз интихоби ронанда ва пости мувофиқ, тугмаи \"Интихоб\"-ро пахш кунед, ки фармоиш ба анҷом мерасад ва шумо тасдиқ мекунед, ки такси барои шумо фармоиш дода шудааст.\n\n" \
"Лутфан интизор шавед, то ронанда ба Шумо хабари қабул кардан ё рад карданро мефиристад. Агар хабар наояд ё ронанда ба Шумо занг назанад, шумо метавонед бо пахши тугмаи 'Ронандаи ман' ё 'Рад кардан' ронандаро рад карда, дигар таксиро фармоиш диҳед."
    )
    await callback_query.message.answer(text)


@start_router.callback_query(lambda c: c.data == "how_driver_list")
async def driver_list_info(callback_query: CallbackQuery):
    text = (
"1. Оғоз ва Бақайдгирии Ронанда 🚘\n\n"
"Пас аз пахши тугмаи 'Ронанда', бот маълумотатонро санҷида, агар қаблан сабти ном шуда бошед, онро нишон медиҳад. Агар сабти ном нашуда бошед, бот аз шумо номи пурраи худро ва рақами телефони худро мепурсад.\n\n"

"2. Ирсоли Суратҳои Мошин 📸\n\n"
"Пас аз ворид кардани рақами телефон, шумо метавонед суратҳои мошини худро ирсол намоед. Пас аз ирсоли ҳар як сурат, бот ба шумо имкони 'Тамом'-ро медиҳад, ки бо пахши он ҳамаи суратҳои ирсолшуда сабт мешаванд.\n\n"

"3. Ивази Маълумоти Аккаунт 🔄\n\n"
"Агар хоҳед маълумоти аккаунти худро иваз кунед, ба шумо тугмаи 'Ивази аккаунт' дастрас мешавад. Дар ин ҳолат, шумо метавонед номи худро, рақами телефони худро ё суратҳои мошинро навсозӣ намоед.\n\n"

"4. Ба қайд гирифтани сафар 🛣️\n\n"
"Барои сабти сафар, тугмаи 'Ба қайд гирифтани сафар' -ро пахш кунед. Бот аз шумо маълумот дар бораи сафарро талаб мекунад, ки онро ворид намуда, ба воситаи ин бот ба дигарон пешниҳод кунед.\n\n"

"5. Сабти Бомуваффақият 🏅\n\n"
"Пас аз он ки тамоми маълумоти лозимиро ворид кунед, бот ба шумо паёми 'Аккаунти шумо муваффақона сабт шуд' -ро мерасонад ва маълумоти профили шуморо намоиш медиҳад."
    )
    await callback_query.message.answer(text)


@start_router.callback_query(lambda c: c.data == "how_create_post")
async def create_post_info(callback_query: CallbackQuery):
    text = (
        "Чӣ тавр пост эҷод кардан:\n\n"
        "1. 🆕 Тугмаи 'Сафари нав ба қайд гирифтан'-ро пахш кунед.\n\n"
        "2. 🏙 Шаҳре ки сафарро оғоз мекунед, интихоб намоед.\n\n"
        "3. 🌆 Шаҳре ки мехоҳед ба он сафар кунед, интихоб кунед.\n\n"
        "4. 💵 Бот нархи сафарро мепурсад — онро ворид намоед.\n\n"
        "5. 👥 Сипас бот шумораи клиентҳоро, ки барои сафар мехоҳед, мепурсад — шумораро ворид кунед.\n\n"
        "6. ✍️ Дар охир, бот аз Шумо хоҳиши навиштани коментарияро мепурсад. Агар коментария надошта бошед, 'не' нависед. Агар дар бораи сафар ягон чиз навистан хоҳед, коментария нависед.\n\n\n"
        "Ҳар як пост дорои тугмаҳои зерин мебошад:\n\n"
        "• 🌐 Онлайн — Ин ҳолатро интихоб кунед, то ки муштариён постро дар ҷустуҷӯ бинанд ва интихоб карда тавонанд. Ҳар посте ки онлайн аст, барои муштариён дастрас аст.\n\n"
        "• 🔒 Офлайн — Ин ҳолатро интихоб кунед, агар хоҳед, ки постро барои муштариён ноаён кунед. Постҳои офлайнро муштариён дида ва интихоб карда наметавонанд.\n\n"
        "• 🗑 Удалить кардан — Барои нест кардани посте, ки дигар ба он эҳтиёҷ надоред.\n\n"
        "• 🚶‍♂️ Ба роҳ баромадан — Вақте ки миқдори клиентҳои лозима ҷамъ мешавад ва шумо барои сафар тайёред, ин тугмаро пахш кунед.\n\n\n"
        "Пас аз анҷоми сафар: Вақте ки ба шаҳр расидед, тугмаи 'Ба шаҳр расидем'-ро пахш кунед, то ки ҳамаи муштариёне ки қабул карда будед тоза шаванд ва ҳолати пости шумо ба офлайн гузарад. Ин ба он маъност, ки то онро дубора онлайн накунед, ҳеҷ кас фармоиши сафари шуморо карда наметавонад.\n\n"
        "💡 Маслиҳат: Бо муштариён хушмуомила бошед. Муштариён пас аз анҷоми сафар метавонанд ба шумо баҳо гузоранд, ки ин ба беҳтар шудани эътибори шумо дар байни онҳо мусоидат мекунад."
    )
    await callback_query.message.answer(text)


@start_router.callback_query(lambda c: c.data == "how_des_menu")
async def create_post_info(callback_query: CallbackQuery):
    text = (
        "Шарҳи тугмаҳои бот:\n\n"
        "1. 🧑‍💻 Истифодабарии бот — Бо пахши ин тугма, шумо дар бораи тарзи истифодаи бот маълумот мегиред.\n\n"
        "2. 📢 Обуна шудан ба гурӯҳ — Ин тугма ба шумо имкон медиҳад, ки ба гурӯҳи 'ронанда' обуна шавед ва аз хабарҳои нав бохабар бошед.\n\n"
        "3. 🚖 Фармоиши таксӣ — Бо ин тугма, шумо метавонед таксиро бо интихоби мошин ва нарх фармоиш кунед.\n\n"
        "4. 👥 Клиентҳои ман — Бо пахши он, ронанда рӯйхати клиентҳои худро мебинад.\n\n"
        "5. 🚗 Ронандаи ман — Бо пахши он, клиент ронандаи интихобкардаашро мебинад.\n\n"
        "6. 📝 Постҳои ман — Бо ин тугма, ронанда метавонад ҳамаи постҳои сафарҳои эҷодкардаашро бубинад ва ҳолати онҳоро назорат кунад.\n\n"
        "7. 👤 Акаунт ҳамчун клиент — Дар ин бахш, клиент метавонад маълумоти шахсии худро бубинад ва онро иваз намояд.\n\n"
        "8. 🚙 Акаунт ҳамчун ронанда — Дар ин қисмат, ронанда метавонад маълумоти шахсии худро бубинад ва дар ҳолати зарурӣ онро тағйир диҳад.\n\n"
        "9. 🆕 Бақайдгирии сафари нав — Бо пахши он, ронанда метавонад барои сафари нав пост эҷод кунад, ки муштариён онро дар рӯйхати таксиҳо бинанд."
    )
    await callback_query.message.answer(text)